# ============================================================================================================================
#   Напишите программу, которая на вход принимает два числа и проверяет, является ли одно число квадратом другого.
def Get_Number():
    while True:
        get_number = input('Введите целое, положительное число: ')
        if get_number.isdigit():
            return get_number

number1 = int(Get_Number())
number2 = int(Get_Number())

if number1 == number2 ** 2 or number2 == number1 ** 2:
    print('yes')
else:
    print('no')

# ===========================================================================================================================
# Напишите программу, которая на вход принимает 5 чисел и находит максимальное из них.

def Num_Max():
    num_max = 0
    for i in range(5):
        num = int(input())
        if num_max < num:
            num_max = num
    return(num_max)

print(Num_Max())

# ===========================================================================================================================
# Напишите программу, каторая на вход принимает число N и выводит все числа от -N до N.

def Range_Number():
    while True:
        number = input('Введите целое, положительное число: ')
        if number.isdigit():
            number1 = int(number) # приводим к зачению int, тк выше бло значение str.
            print(list(range(-number1, number1 + 1))) # или можно вместо list поставить * -> print(*range(-number, number + 1))
            break
Range_Number()

# ===========================================================================================================================
# Напишите программу, каторая будет на вход принимать дробь и выводить первую цифру дробной части числа.
# in 0.73  out 7
# in 2.48  out 4
# in 5     out no

def Show_Second_Number():
    number = float(input('Input your number: '))
    new_number = int(number * 10 % 10)
    if new_number == 0:
        print('Вы ввели целое число, дробой части у целого числа нет.')
    else:
        print(f'У числа {number} первая цифра дробной части -> {new_number}')

Show_Second_Number()

# ==========================================================================================================================
# Напишите программу, каторая на вход принимает целое число и проверяет, кратно ли оно 5 И 10 ИЛИ 15, НО НЕ 30.
def Multiple():
    multiple_num = int(input('Input your number: '))
    if (multiple_num % 5 == 0 and multiple_num % 10 == 0 or multiple_num % 15 == 0) and not multiple_num % 30 == 0:
        print('yes')
    else:
        print('no')

Multiple()

# ==========================================================================================================================
#  Пример проверки ложности утверждения (x ≡ z) ⋎ (x → (y ⋏ z))

print('x y z')
for x in range(2):
    for y in range(2):
        for z in range(2):
            if  not (x == z or x <= y and z): # утверждение (x ≡ z) ⋎ (x → (y ⋏ z)) в задании соответствует утверждению x == z or x <= y and z в языке Python и
                #                               работает для проверки истинности, но нам по заданию необходимо проверить ложность утверждения
                #                               и по этому нам нужно развернуть утверждение. Для этого мы обернули в скобки и перед скобкой написали not.
                print(x, y, z)

# ==========================================================================================================================
