#  Ресурс DOCS-PYTHON.RU посвящен языку программирования Python3 и представляет из себя справочную документацию. https://docs-python.ru
# ======================================================= Методы в tuple (кортеж) ===========================================================
#
#                'clear', 'copy', 'fromkeys', 'get', 'items', 'keys', 'pop', 'popitem', 'setdefault', 'update', 'values'
#
# ============================================================================================================================================
#
