#  Ресурс DOCS-PYTHON.RU посвящен языку программирования Python3 и представляет из себя справочную документацию. https://docs-python.ru
# ======================================================= Методы в frozenset (неизменное множество) ===========================================
#
#                   'copy', 'difference', 'intersection', 'isdisjoint', 'issubset', 'issuperset', 'symmetric_difference', 'union'
#
# =============================================================================================================================================
#
