# Задача 1 _____________________________________________________
# Создать телефонный справочник с возможностью импорта и экспорта данных в формате .txt. Фамилия, имя, отчество, номер телефона
# - данные, которые должны находиться в файле.
# Программа должна выводить данные
# Программа должна сохранять данные в текстовом файле
# Пользователь может ввести одну из характеристик для поиска определенной записи(Например имя или фамилию человека)
# Использование функций. Ваша программа не должна быть линейной

with open('phonebook.txt', 'a', encoding="utf-8") as my_file:
    my_file.write(F'{b}x**2 + {b}x + {c} = 0\n')
